1. Setting Router
   VLAN 1 
   R1>enable
   R1#configure terminal
   R1(config)#interface Ethernet 0
   R1(config-subif)#interface Ethernet 0.90 
   R1(config-subif)#ip address 10.10.123.1 255.255.255.0
   R1(config-subif)#end
   R1(config-if)#exit
   R1(config)#exit
   %SYS-5-CONFIG_I: Configured from console by console
 
   VLAN 2
   R1>enable
   R1#configure terminal
   R1(config)#interface Ethernet 0
   R1(config-subif)#interface Ethernet 0.90
   R1(config-subif)#ip address 10.10.124.1 255.255.255.0
   R1(config-subif)#end
   R1(config-if)#exit
   R1(config)#exit
   %SYS-5-CONFIG_I: Configured from console by console


   VLAN 3
   R1>enable
   R1#configure terminal
   R1(config)#interface Ethernet 0
   R1(config-subif)#interface Ethernet 0.90
   R1(config-subif)#ip address 10.10.125.1 255.255.255.0
   R1(config-subif)#end
   R1(config-if)#exit
   R1(config)#exit
   %SYS-5-CONFIG_I: Configured from console by console

2. Setting PC

   VLAN 1
   PC 1 
   PC1>ip 10.10.123.5/24 10.10.123.1
   PC1>show ip
   PC1>ping 10.10.123.5

   PC 2 
   PC1>ip 10.10.123.5/24 10.10.123.1
   PC1>show ip
   PC1>ping 10.10.123.5


   VLAN 2
   PC 3 
   PC1>ip 10.10.123.5/24 10.10.123.1
   PC1>show ip
   PC1>ping 10.10.123.5

   PC 4 
   PC1>ip 10.10.123.5/24 10.10.123.1
   PC1>show ip
   PC1>ping 10.10.123.5


   VLAN 3
   PC 5 
   PC1>ip 10.10.123.5/24 10.10.123.1
   PC1>show ip
   PC1>ping 10.10.123.5

   PC 6 
   PC1>ip 10.10.123.5/24 10.10.123.1
   PC1>show ip
   PC1>ping 10.10.123.5




