Membuat Jaringan VLAN 100, 200, 300 dan 400 di 3 Lantai Menggunakan 3 Switch
Router yang digunakan : Router Cisco 1700

1. Setting Router
   VLAN 100
   R1>enable
   R1#configure terminal
   R1(config)#interface Ethernet 0
   R1(config-subif)#interface Ethernet 0.28 
   R1(config-subif)#ip address 10.212.28.1 255.255.255.0
   R1(config-subif)#end
   R1(config-if)#exit
   R1(config)#exit
   %SYS-5-CONFIG_I: Configured from console by console
 
   VLAN 200
   R1>enable
   R1#configure terminal
   R1(config)#interface Ethernet 0
   R1(config-subif)#interface Ethernet 0.36
   R1(config-subif)#ip address 10.212.36.1 255.255.255.0
   R1(config-subif)#end
   R1(config-if)#exit
   R1(config)#exit
   %SYS-5-CONFIG_I: Configured from console by console


   VLAN 300
   R1>enable
   R1#configure terminal
   R1(config)#interface Ethernet 0
   R1(config-subif)#interface Ethernet 0.41
   R1(config-subif)#ip address 10.212.41.1 255.255.255.0
   R1(config-subif)#end
   R1(config-if)#exit
   R1(config)#exit
   %SYS-5-CONFIG_I: Configured from console by console
   
   VLAN 400
   R1>enable
   R1#configure terminal
   R1(config)#interface Ethernet 0
   R1(config-subif)#interface Ethernet 0.21
   R1(config-subif)#ip address 10.212.21.1 255.255.255.0
   R1(config-subif)#end
   R1(config-if)#exit
   R1(config)#exit
   %SYS-5-CONFIG_I: Configured from console by console

2. Setting PC

   LANTAI 1
   PC 1 
   PC1>ip 10.212.36.2/24 10.212.36.1
   PC1>show ip
   PC1>ping 10.212.28.2

   PC 2 
   PC1>ip 10.212.28.2/24 10.212.28.1
   PC1>show ip
   PC1>ping 10.212.36.2
   
   PC 3 
   PC1>ip 10.212.41.3/24 10.212.41.1
   PC1>show ip
   PC1>ping 10.10.123.5

   PC 4 
   PC1>ip 10.212.21.3/24 10.212.21.1
   PC1>show ip
   PC1>ping 10.10.123.5


   LANTAI 2
   PC 5 
   PC1>ip 10.212.36.4/24 10.212.36.1
   PC1>show ip
   PC1>ping 10.212.36.5

   PC 6 
   PC1>ip 10.212.28.4/24 10.212.28.1
   PC1>show ip
   PC1>ping 10.212.28.5
   
   PC 7 
   PC1>ip 10.212.21.5/24 10.212.21.1
   PC1>show ip
   PC1>ping 10.212.21.5

   PC 8 
   PC1>ip 10.212.41.5/24 10.212.41.1
   PC1>show ip
   PC1>ping 10.212.21.5


   LANTAI 3
   PC 9 
   PC1>ip 10.212.36.6/24 10.212.36.1
   PC1>show ip
   PC1>ping 10.212.36.6

   PC 10 
   PC1>ip 10.212.28.6/24 10.212.28.1
   PC1>show ip
   PC1>ping 10.212.28.6
   
   PC 11 
   PC1>ip 10.212.21.7/24 10.212.21.1
   PC1>show ip
   PC1>ping 10.212.21.7

   PC 12 
   PC1>ip 10.212.41.7/24 10.212.41.1
   PC1>show ip
   PC1>ping 10.212.41.7




