Membuat VTP (VLAN Trunking Protokol) Domain Server dan VTP Domain Client
Menggunakan 2 Router dan 3 Switch.
Router yang digunakan : Router Cisco 1700

1. Membuat VLAN
   R1#vlan database
   R1(VLAN)#vlan 100
   R1(VLAN)#apply
   R1(VLAN)#show
   R1(VLAN)#exit
   
   
2. Membuat IP VLAN
   R1#config terminal
   R1(Config)#interface ethernet 0
   R1(Config-if)#interface ethernet 0.42
   R1(Config-subif)#ip address 10.111.42.1 255.255.255.0
   R1(Config)#exit
   
   
3. Membuat VTP Client
   R1#vlan database
   R1(VLAN)#show
   R1(VLAN)#vtp client
   R1(VLAN)#vtp domain Mengkudu
   R1(VLAN)#vtp password 12345
   R1(VLAN)#exit
   R1#show vtp status


4. Membuat VTP Server
   R1#vlan database
   R1(VLAN)#show
   R1(VLAN)#vtp server
   R1(VLAN)#vtp domain Mengkudu
   R1(VLAN)#vtp password 12345
   R1(VLAN)#exit
   R1#show vtp status


SETTING IP Server
-------------------------------------------------------------
R1>enable
R1#configure terminal
R1(config)#interface Ethernet 0
R1(config-subif)#interface Ethernet 0.42
R1(config-subif)#ip address 10.111.42.1 255.255.255.0
R1(config-if)#exit
R1(config)#exit
%SYS-5-CONFIG_I: Configured from console by console
------------------------------------------------------------

Server 1
gateway    10.111.42.1
netmask    255.255.255.0

Server2
gateway    10.111.44.1
netmask    255.255.255.0

Server3
gateway    10.111.46.1
netmask    255.255.255.0

Server4
gateway    10.111.48.1
netmask    255.255.255.0

---------------------------------------------
PC-Server( 4 PC server)
Contoh Setting PC Server
PC1>ip 10.111.42.2/24 10.111.42.1
PC1>show ip
PC1>ping 10.111.42.2
---------------------------------------------

PC-Server1 
gateway    10.111.42.1
netmask    255.255.255.0
ip address 10.111.42.5

PC-Server2 
gateway    10.111.44.1
netmask    255.255.255.0
ip address 10.111.44.5

PC-Server3 
gateway    10.111.46.1
netmask    255.255.255.0
ip address 10.111.46.5

PC-Server4
gateway    10.111.48.1
netmask    255.255.255.0
ip address 10.111.48.5

-----------------------------------------------
PC-Client( 8 PC Client)
Switch 2
Setting PC Client (1,2,3,4)
PC1>ip 10.111.42.7/24 10.111.42.1
PC1>show ip
PC1>ping 10.111.42.7
-----------------------------------------------

PC-Client1 
gateway    10.111.42.1
netmask    255.255.255.0
ip address 10.111.42.7

PC-Client2 
gateway    10.111.44.1
netmask    255.255.255.0
ip address 10.111.44.7

PC-CLient3 
gateway    10.111.46.1
netmask    255.255.255.0
ip address 10.111.46.7

PC-Client4
gateway    10.111.48.1
netmask    255.255.255.0
ip address 10.111.48.7


-----------------------------------------------
Switch 3
Setting PC Client (5,6,7,8)
PC1>ip 10.111.42.8/24 10.111.42.1
PC1>show ip
PC1>ping 10.111.42.8
-----------------------------------------------
PC-Client5 
gateway    10.111.42.1
netmask    255.255.255.0
ip address 10.111.42.8

PC-Client6 
gateway    10.111.44.1
netmask    255.255.255.0
ip address 10.111.44.8

PC-CLient7 
gateway    10.111.46.1
netmask    255.255.255.0
ip address 10.111.46.8

PC-Client8
gateway    10.111.48.1
netmask    255.255.255.0
ip address 10.111.48.8


Catatan :
- VTP Server bisa membuat, mengubah, dan menghapus VLAN. Memforward VTP update serta memproses VTP update
  yang diterimanya.
- VTP Client tidak bisa membuat VLAN. Hanya memproses VLAN yang diterima melalui VTP update yang dikirimkan
  oleh VTP Server
- Semua mode VTP apapun yang berada dalam VTP domain yang sama akan meneruskan VTP update yang diterimanya
  ke switch yang lain.
  



