Protokol OSPF

-------------------------------------------
A 1.10.50.0/30     |
B 2.20.100.0/30    |
                    } 4 Host
C 3.30.150.0/30    |
D 4.40.200.0/30    |


NETWORK 1          |
10.50.170.0/29     |
                    } 8 Host
NETWORK 2          |
10.50.180.0/29     |
---------------------------------------------

Router yang digunakan : Router Cisco 3600     
A. Setting Router (ROUTER-1)  
   R1#config terminal      
   R1(config-if)#interface ethernet 0/0
   R1(config-if)#ip address 1.10.50.1 255.255.255.252
   R1(config-if)#no shutdown
   
   R1(config-if)#interface ethernet 0/1
   R1(config-if)#ip address 2.20.100.1 255.255.255.252
   R1(config-if)#no shutdown  
   
   R1(config-if)#exit
   R1(config)#write (Save progress)
   R1(config)#exit
   R1#show ip interface brief
   
B. Setting Router (ROUTER-2)  
   NETWORK-1
   R2#config terminal 
   R2(config)#interface Ethernet0/3
   R2(config-if)#ip address 10.50.170.1 255.255.255.248
   R2(config-if)#no shutdown
   
   R2(config-if)#interface ethernet 0/0
   R2(config-if)#ip address 1.10.50.2 255.255.255.252
   R2(config-if)#no shutdown
   
   R2(config-if)#interface ethernet 0/1
   R2(config-if)#ip address 4.40.200.1 255.255.255.252
   R2(config-if)#no shutdown  
   
   R2(config-if)#exit
   R2(config)#write (Save progress)
   R2(config)#exit
   R2#show ip interface brief
   
C. Setting Router (ROUTER-3)      
   NETWORK-2
   R3#config terminal 
   R3(config)#interface Ethernet0/3
   R3(config-if)#ip address 10.50.180.1 255.255.255.248
   R3(config-if)#no shutdown
   
   R3(config-if)#interface ethernet 0/0
   R3(config-if)#ip address 3.30.150.1 255.255.255.252
   R3(config-if)#no shutdown
   
   R3(config-if)#interface ethernet 0/1
   R3(config-if)#ip address 2.20.100.2 255.255.255.252
   R3(config-if)#no shutdown  
   
   R3(config-if)#exit
   R3(config)#write (Save progress)
   R3(config)#exit
   R3#show ip interface brief
   
D. Setting Router (ROUTER-4) 
   R4#config terminal       
   R4(config-if)#interface ethernet 0/0
   R4(config-if)#ip address 4.40.200.2 255.255.255.252
   R4(config-if)#no shutdown
   
   R4(config-if)#interface ethernet 0/1
   R4(config-if)#ip address 3.30.150.2 255.255.255.252
   R4(config-if)#no shutdown  
   
   R4(config-if)#exit
   R4(config)#write (Save progress)
   R4(config)#exit
   R4#show ip interface brief
   
E. Setting Protokol OSPF
   ROUTER-1
   R1#config terminal      
   R1(config)#router ospf 1
   R1(config-router)#network 1.10.50.0 0.0.0.3 area 0
   R1(config-router)#network 4.40.200.0 0.0.0.3 area 0
   R1(config)#write (Save progress)
   R1(config-if)#exit
   R1(config)#exit
   R1#show ip route  
   
   ROUTER-2
   R2#config terminal      
   R2(config)#router ospf 1
   R2(config-router)#network 1.10.50.0 0.0.0.3 area 0
   R2(config-router)#network 2.20.100.0 0.0.0.3 area 0
   R2(config-router)#network 10.50.170.0 0.0.0.7 area 0
   R2(config)#write (Save progress)
   R2(config-if)#exit
   R2(config)#exit 
   R2#show ip route
   
   ROUTER-3
   R3#config terminal      
   R3(config)#router ospf 1
   R3(config-router)#network 3.30.150.0 0.0.0.3 area 0
   R3(config-router)#network 2.20.100.1 0.0.0.3 area 0
   R2(config-router)#network 10.50.180.0 0.0.0.7 area 0   
   R3(config-if)#exit
   R3(config)#write (Save progress)
   R3(config)#exit    
   R3#show ip route
   
   ROUTER-4
   R4#config terminal      
   R4(config)#router ospf 1
   R4(config-router)#network 3.30.150.0 0.0.0.3 area 0
   R4(config-router)#network 4.40.200.0 0.0.0.3 area 0
   R4(config-if)#exit
   R4(config)#write (Save progress)
   R4(config)#exit 
   R4#show ip route
   
F. Setting PC
   NETWORK-1
   PC3>ip 10.50.170.4/29 10.50.170.1 
   PC3>show ip
   PC3>save
   
   PC2>ip 10.50.170.2/29 10.50.170.1 
   PC2>show ip
   PC2>save
   
   NETWORK-2
   PC1>ip 10.50.180.5/29 10.50.180.1 
   PC1>show ip   
   PC1>save
   
   PC4>ip 10.50.180.3/29 10.50.180.1 
   PC4>show ip
   PC4>save
   

   
