Protokol EIGRP

A 15.50.20.0/30
B 25.100.30.0/30
C 35.150.40.0/30
D 45.200.50.0/30

Network 1
169.254.104.0/29


Network 2
169.254.208.0/29

Router yang digunakan : Router Cisco 3600     
A. Setting Router (ROUTER-1)  
   R1#config terminal      
   R1(config-if)#interface ethernet 0/0
   R1(config-if)#ip address 15.50.20.1 255.255.255.252
   R1(config-if)#no shutdown
   
   R1(config-if)#interface ethernet 0/1
   R1(config-if)#ip address 25.100.30.1 255.255.255.252
   R1(config-if)#no shutdown  
   
   R1(config-if)#exit
   R1(config)#write
   R1(config)#exit
   R1#show ip interface brief
   
B. Setting Router (ROUTER-2)  
   NETWORK-1
   R2#config terminal 
   R2(config)#interface Ethernet0/2
   R2(config-if)#ip address 169.254.104.1 255.255.255.248
   R2(config-if)#no shutdown
   
   R2(config-if)#interface ethernet 0/0
   R2(config-if)#ip address 15.50.20.2 255.255.255.252
   R2(config-if)#no shutdown
   
   R2(config-if)#interface ethernet 0/1
   R2(config-if)#ip address 35.150.40.1 255.255.255.252
   R2(config-if)#no shutdown  
   
   R2(config-if)#exit
   R2(config)#write
   R2(config)#exit
   R2#show ip interface brief
   
C. Setting Router (ROUTER-3)      
   NETWORK-2
   R3#config terminal 
   R3(config)#interface Ethernet0/2
   R3(config-if)#ip address 169.254.208.1 255.255.255.248
   R3(config-if)#no shutdown
   
   R3(config-if)#interface ethernet 0/0
   R3(config-if)#ip address 25.100.30.1 255.255.255.252
   R3(config-if)#no shutdown
   
   R3(config-if)#interface ethernet 0/1
   R3(config-if)#ip address 45.200.50.1 255.255.255.252
   R3(config-if)#no shutdown  
   
   R3(config-if)#exit
   R3(config)#write
   R3(config)#exit
   R3#show ip interface brief
   
D. Setting Router (ROUTER-4) 
   R4#config terminal       
   R4(config-if)#interface ethernet 0/0
   R4(config-if)#ip address 45.200.50.2 255.255.255.252
   R4(config-if)#no shutdown
   
   R4(config-if)#interface ethernet 0/1
   R4(config-if)#ip address 35.150.40.2 255.255.255.252
   R4(config-if)#no shutdown  
   
   R4(config-if)#exit
   R4(config)#write
   R4(config)#exit
   R4#show ip interface brief
   
E. Setting Protokol OSPF
   ROUTER-1
   R1#config terminal      
   R1(config)#router eigrp 101
   R1(config-router)#network 15.50.20.0 0.0.0.3
   R1(config-router)#network 25.100.30.0 0.0.0.3
   R1(config)#write
   R1(config-if)#exit
   R1(config)#exit
   R1#show ip route  
   
   ROUTER-2
   R2#config terminal      
   R2(config)#router ospf 101
   R2(config-router)#network 15.50.20.0 0.0.0.3
   R2(config-router)#network 35.150.40.0 0.0.0.3
   R2(config-router)#network 169.254.104.0 0.0.0.7
   R2(config)#write (Save progress)
   R2(config-if)#exit
   R2(config)#exit 
   R2#show ip route
   
   ROUTER-3
   R3#config terminal      
   R3(config)#router ospf 101
   R3(config-router)#network 25.100.30.0 0.0.0.3
   R3(config-router)#network 45.200.50.0 0.0.0.3
   R2(config-router)#network 169.254.208.0 0.0.0.7   
   R3(config-if)#exit
   R3(config)#write
   R3(config)#exit    
   R3#show ip route
   
   ROUTER-4
   R4#config terminal      
   R4(config)#router ospf 101
   R4(config-router)#network 45.200.50.0 0.0.0.3 area 0
   R4(config-router)#network 35.150.40.0 0.0.0.3 area 0
   R4(config-if)#exit
   R4(config)#write
   R4(config)#exit 
   R4#show ip route

F. Setting PC
   NETWORK-1
   PC3>ip 169.254.104.4/29 169.254.104.1 
   PC3>show ip
   PC3>save
   
   PC2>ip 169.254.104.3/29 169.254.104.1 
   PC2>show ip
   PC2>save
   
   NETWORK-2
   PC1>ip 169.254.208.5/29 169.254.208.1 
   PC1>show ip   
   PC1>save
   
   PC4>ip 169.254.208.2/29 169.254.208.1  
   PC4>show ip
   PC4>save
   
